
[
 
  {   "name"  : "Emmet Apolinario",
      "photo" :  "Emmet_Apolinario.jpg",
      "title" : "President, Ohio Business Association <br> Columbus, OH",
      "topic" : "LEADERSHIP: Panel - Success Stories from Filipino American Entrepreneurs – Generation X",
      "bio" : " Emmet Apolinario is President of the Ohio Business Brokers Association (http://www.obba.org). He is an award-winning entrepreneur and a frequent speaker to various business events in Central Ohio. In 2002, Emmet was awarded “Small Business Leader of the Year” by both the Small Business Administration and the Columbus Chamber of Commerce. Prior to acquiring a branch location of Sunbelt Business Advisors Network, he led a successful turnaround of a Midwest regional technology service company. He acquired this company through a leverage buyout. After successfully restructuring debt and operations Emmet led the company to profitability and for three years in a row the company was recognized as one of Ohio’s fifty fastest growing companies. In addition to his involvement in the technology sector, he has a broad business background that includes service, distribution and outsourcing industries. Originally from the Philippines, Emmet’s global business perspective is an advantage when it comes to viewing business development, franchising and investment banking from a national and international outlook. With the current emphasis on “globalization” in many industry groups, his awareness of international trends helps provide additional insight in business brokerage transactions. <br> <br> Emmet is a Certified Exit Planning Advisor, certified through the Exit Planning Institute (http://www.exit-planning-institute.org). He is one of the less than 200 business advisors internationally with such certificaiton. Certified Exit Planning Advisors complete a challenging 4 day program that involves approximately 100 hours of pre-course study, 36 hours of class room instruction, and successful completion of a 4-hour rigorous proctored examination. <br> <br> Emmet conducts and leads a monthly meeting second Wednesday of each month for the Ohio Business Brokers Association where he leads discussions pertaining to the many complex and compicated facets of the business transfer process. The third Thursday of each month, you will also find him conducting a workshop session called Executive Straight Talk, a monthly workshop series held at Columbus State Workforce Development Center on Cleveland Avenue where he brings in entrepreneurs and business thought leaders to discuss relevant business topics that revolve around business growth strategies along with best practice areas. He is a monthly contributor to several blogposts that pertain to the confidential sale and purchase of privately-held businesses. Details or invitation to these sessions could be requested through emailing info@valuationpartner.com <br> <br> Memberships: International Business Brokers Association; Ohio Business Brokers Association; Rotary International; Columbus Chamber of Commerce; Dublin Chamber of Commerce; Columbus Technology Council; Entrepreneur Exchange Group; International Franchise Association. <br> <br> Advisory and Boards: ProTeam Resources, Inc – Advisory Board; TCS Software, Inc. – Advisory Board; PMG Video Communications – Advisory Board; South Central Ohio Minority Council – Board and Trustee; Top Contributors to the Advancement of Technology – Executive Committee."
},

  {   "name"  : "Paul Beck",
      "photo" :  "Paul_Beck.jpg",
      "title" : "Professor Emeritus in Political Science, The Ohio State University <br> Columbus, OH",
      "topic" : "PARTNERSHIP: Impact of Election Results from a Non-Partisan",
      "bio" : " Paul Beck is a Professor Emeritus of Political Science and member of the Emeritus Academy at The Ohio State University. <br>  <br> Before retiring in July 2012, Paul was Distinguished Professor of Social and Behavioral Science and Professor of Political Science with courtesy professor appointments in the School of Communication and Department of Sociology at Ohio State; Dean of the College of Social and Behavioral Sciences at Ohio State; and Chair of its Department of Political Science. His articles on political parties, voting behavior, and public opinion are published in leading disciplinary and interdisciplinary journals. He was author/co-author of Party Politics in America (1988, 1992, 1997, 2001) and co-editor of Electoral Change in Advanced Industrial Democracies (1984). His co-edited book Voting in Old and New Democracies, based on Comparative National Election Project (CNEP) surveys of the electorates in 26 elections in 18 countries, was published by Routledge in October 2016. His current research is focused around themes studied in the CNEP (http://u.osu.edu/cnep), which now includes over 30 surveys through 2015. Paul has received the Distinguished Scholar and Distinguished University Service awards from Ohio State University and the American Political Science Association’s Goodnow Award for distinguished service to the profession and its Eldersveld Award for lifetime professional contributions to the field of political organizations and parties. He is a regular commentator on American politics for a variety of international, national, and local media."
},

  {   "name"  : "Chris Borja",
      "photo" :  "Chris_Borja.jpg",
      "title" : "Professional Networker, Connector, Trainer <br> Dublin, OH",
      "topic" : "PLENARY: Networking Icebreaker",
      "bio" : " While originally from Southern California, Chris Borja has called Columbus, Ohio his home for the last 9 years. He has been married for 19 years, and has 2 teenagers in high school. Professionally, he has been an entrepreneur for as long as he can remember. The problem is that he has always been very introverted and shy, which is not good for building a business! <br> <br> After 37 years of suffering in silence (literally), he made a decision to take the steps to overcome his fear of public speaking, networking, and social settings. He now helps entrepreneurs, job-seekers, and business leaders break through their mental barriers to Become a Better Networker! <br> <br> Chris is a proud Independent Associate with LegalShield, where he has the opportunity to help individuals, business owners, and their employees, to have access to attorneys without worrying about the cost! In addition to the legal service plans, his company offers identity theft protection, which includes a licensed private investigator to restore their member's identities to a pre-breach condition, saving their members time, frustration, and worry. <br> <br> Chris loves to network, so send him a connection request, and introduce yourself! Chris says, 'Let's see what we can do together!'"
},

  {   "name"  : "Consul General Generoso D.G. Calonge",
      "photo" :  "Generoso_D_G_Calonge.jpg",
      "title" : "Consul General of the Philippines <br> Chicago, Illinois",
      "topic" : "INDUCTING OFFICIAL: 2017-2020 NaFFAA R3E Officers",
      "bio" : "Consul General Generoso D.G. Calonge is responsible for the Consulate General of the Philippines in Chicago, which was established in 1948. The Philippine Consulate General aims to foster close and mutually beneficial relations between the Philippines and the Midwest region of the United States, particularly in the fields of trade, investments, tourism, culture and people-to-people relations. The Consulate also services the consular requirements of the growing Filipino community, extends assistance to nationals in distress and conducts regular outreach programs to the 16 states under its jurisdiction. <br> <br> The Philippine Consulate General in Chicago covers the following states: <br> <br> Arkansas, Illinois, Indiana, Iowa, Kansas, Louisiana, Michigan, Minnesota, Mississippi, Missouri, Nebraska, North Dakota, Ohio, Oklahoma, South Dakota, and Wisconsin"
},

  {   "name"  : "Angelo Campos",
      "photo" :  "Angelo_Campos.jpg",
      "title" : "Co-Founder, Tres Mentes Salsa <br> Des Moines., IA",
      "topic" : "LEADERSHIP: Panel - Success Stories from Filipino American Entrepreneurs – Millennials",
      "bio" : " <br> <br>  <br> <br>  <br> <br> "
},

  {   "name"  : "Roel Campos",
      "photo" :  "Roel_Campos.jpg",
      "title" : "Chair, National Federation of Filipino American Associations Region 3 East (NaFFAA R3E) <br> <br> Adjunct Professor in Information Systems, Drake University <br> Des Moines, IA",
      "topic" : "PARTNERSHIP: Iowa Asian Alliance & Monsoon United Asian Women of Iowa",
      "bio" : " <br> <br>  <br> <br>  <br> <br> "
},

  {   "name"  : "Kimberly Carter, PhD",
      "photo" :  "Kimberly_Carter.jpg",
      "title" : "Owner/CEO, DrKimCarter & The Leader Architect Group <br> Columbus, OH",
      "topic" : "LEADERSHIP: Leadership Competencies",
      "bio" : " Dr. Kim Carter, is a Keynote Speaker, Published Author, Leadership and Organizational Development Strategist, DiSC & MBTI Certified Trainer, and an Award-Winning Dean. A thought leader and engagement expert in organizational development, strategic management, & leadership, she “Equips Leaders & their Teams with Cutting-edge Business Development Designs for Phenomenal Performance Growth.” She excels in client and stakeholder engagement and has been the frontrunner and engagement champion in private, public, collegiate, and municipal environments. She has led phenomenal teams to become the top performers in their industry and will ensure her clients transcend their platform to unimaginable heights. <br> <br> Kimberly has <br>  <br> * More than 22 years of leadership, program development and oversight, organizational design and strategic planning <br> * Develops agency crisis management plans which included the foundation for new business models <br> * Managed over $507 million in program funds <br> * Negotiated debt forgiveness by over $250,000, 13 liens, and successful IRS Compromise for an agency in less than two years <br> * Successfully obtained over $1million in funds from various sources within 24 month <br> * Possesses 17 years in faculty oversight, personnel recruitment, training and development, retention, and performance measurement <br> * Instructing for more than 16 years in Higher Education, Course Developer, and Hiring Evaluator and Faculty Coach <br> * Numerous exceptional performance awards including U.S. Presidential Recognition & Women of Distinction Award <br> <br> Kimberly's Specialties: <br> Accomplished in Corporate Relations, Private Lending, Government Affairs, Entrepreneurship, Regulation and Compliance Monitoring, Project Management, Performance Measurement, Human Resource Management, Union Negotiations, Crisis Management, Academic Readiness, and Community Development in Government, Non-Profit, and Faith-Based arenas."
},

  {   "name"  : "Krista Cavalieri, CFP",
      "photo" :  "Krista_Cavalieri.jpg",
      "title" : "Owner & Lead Advisor, Evolve Capital <br> Columbus, OH",
      "topic" : "MENTORHIP: Finance-Investments-Budgets-Savings-Retirement-Taxes-401k",
      "bio" : "At Evolve Capital, Krista Cavalieri company is planning for the current generation. They are not your parent's advisors. They see your potential. They harness your accomplishments to help you conquer life."
},

  {   "name"  : "Christine Chen",
      "photo" :  "Christine_Chen.jpg",
      "title" : "APIAVote Executive Director <br> Washigton, DC",
      "topic" : "LEADERSHIP: Panel - The Rise of Filipino Americans in U.S. Politics/Public Service",
      "bio" : " Christine Chen, the founding executive director from 2006-2008 returned to APIAVote in January 2011 to serve as its current Executive Director. During her tenure she had strengthened and expanded APIAVote's partners into 22 states. APIAVote’s research and polling of Asian American voters and their regional trainings and field programs have strengthened the local grassroots programs in reaching and mobilizing Asian American and Pacific Islander voters. Through all these efforts, APIAVote has played a key role in elevating the Asian American and Pacific Islander electorate to an unprecedented national level in recent years. <br> <br> In addition Christine serves as President of Strategic Alliances USA, a consulting firm specializing in coalition building, institutional development, and partnerships among the corporate sector, government agencies, and the nonprofit and public sector. <br> <br> Profiled by Newsweek magazine in 2001 as one of 15 women who will shape America’s new century, Christine served from 2001 to 2005 as national executive director of the Organization of Chinese Americans (OCA), one of the leading APIA civil rights organizations in the country. Leading an organization with more than 80 chapters and affiliates across the nation, she worked with OCA’s national board, executive council, chapter representatives, members and funders while managing a staff of 13. <br> <br> Christine is well-known by activists across the county. Her track record in building coalitions and working at the grassroots and national levels established her as one of the strongest voices in the APIA community. She has more than two decades of experience in organizing and advocating on issues such as immigration, hate crimes, affirmative action, census, racial profiling, voting rights, election reform, and various derogatory and racist media incidents. Her role as a trusted coalition builder has her effectively building relationships with key Congressional offices including the Congressional Asian Pacific American Caucus, federal agencies, and the administration. <br> <br> Throughout the years with Christine's multitasking abilities, she was also a member of the executive committee of the Leadership Conference on Civil Rights. She served on numerous boards such as the National Council of Asian Pacific Americans, Demos Board of Trustees, Conference on Asian Pacific American Leadership (CAPAL), Youth Vote, Gates Millennium Scholarship Advisory Council, advisory board for the Progressive Majority Racial Justice Campaign, and the Board of Advisors for the Midwest Asian American Students Union, East Coast Asian American Students Union and the Asian Pacific American Medical Students Association. In 2003, she was a founding member of the Asian and Pacific Islander American Scholarship Fund and also in 2006, a founding member of Asian and Pacific Islander American Vote. <br> <br> Christine currently serves on the Kennedy Center Community Advisory Board, Center for Asian American Media, OCA Northern Virginia Chapter, and the advisory boards for the Asian Pacific American Medical Students Association (APAMSA), and CAPAL."
},

  {   "name"  : "Willie D. Dechavez",
      "photo" :  "Willie_Dechavez.jpg",
      "title" : "State Chair, USP4GG Michigan",
      "topic" : "LEADERSHIP: A Viable Community Organization - USP4GG Michigan",
      "bio" : "Willie Dechavez is the current State Chairperson of USP4GG Michigan and past NaFFAA Michigan Chair for 11 years. <br> <br> He has served as Executive Director of NaFFAA Midwest Empowerment Conference in 2002, and the Event Chair -10th Empowerment National Conference in Detroit 2012. He was a founding member, Cultural Chairperson and a past VP of the Council of Asia Pacific Americans (CAPA) in Michigan. He chaired the first Splendor of the East event. He holds several government-appointed positions: past Macomb County Historical Commissioner; past Board of Director, Cornerstone Development Authority, City of Southfield; past chairperson, Ethnic Community Issues Committee, City of Sterling Heights: past Board of Trustee, Henry Ford System Hospital Behavioral Health. He was appointed by Michigan Governor Jennifer Granholm as a member of the Advisory Council for Asian American Pacific Affairs in 2005. Governor Snyder appointed him as one of the Commissioners of MAPAAC- Michigan Asian Pacific American Affairs Commission for 8 years. He is the current VP of APIA Vote Michigan and the city of Sterling Heights Ethnic Community Committee. <br> <br> Willie received the 2002 Banaag Presidential Award for Filipinos Overseas (Philippines), 2002 Governor Service Award, 2001 Macomb County Volunteer of the Year Award, 1997 Fulbright Teacher Japan Travel, 2001 Michigan Teacher of the Year - Finalist, and the MaryGrove College Professional Teacher Award. He received the 2005 MetLife Foundation Ambassador in Education Award and was the 2005 Diversity Champion Awardee. He is the 2010 Gintong Pamana Awardee on Community Leadership (Chicago) and Tanglaw Award in Education (1997) the 2010 Asian American Journalist Association Awardee. Corp Magazine recognized him with a Diversity Excellence Award in 2010; a Diversity Distinction Awardee 2015 of City of Sterling Heights; Spirit of City of Detroit Award in 2016.He has served as Chairperson on various events such as FILAMCCO's Rizal Day and Kalayaan Picnics, PACCM Rice Festival, Valentine's Ball and Consulate on Wheels, ICRJ Martin Luther King, Jr Annual Celebration (first and only Asian to Chair this event ) and MAPAAC Asian Heritage Day in Lansing for 4 years in a row. <br> <br> Willie is a retired certified educator with the Detroit Public Schools and a DIA Asian Arts Community Consultant member . A graduate of the University of Sto. Tomas, with a major in Political Science, he earned a Masters Degree in Special Education and an Educational Specialist Degree in School Administration from Wayne State University."
},

  {   "name"  : "Imelda Castaneda Emenaker, EdD",
      "photo" :  "Imelda_Castaneda_Emenaker.jpg",
      "title" : "Senior Research Associate, Dept of Education, University of Cincinnati <br> Cincinnati, OH",
      "topic" : "MENTORSHIP: Interactive Exercise / Essentials on Public Speaking",
      "bio" : " Dr. Imelda Castañeda-Emenaker has had primary responsibility for the coordination, design, and implementation of numerous evaluations of projects related to PreK-16 education in the areas of curriculum, multiple intelligences, student performance assessments, teacher professional development, evaluation capacity building, alternative schools, and college access, as well as community development projects related to economics, health, and education. She has an MBA and an Ed.D. in educational studies. Imelda has taught business, statistics, assessment, and evaluation courses. In her teaching and work experiences, she has always included experiential learning, simulated activities, and applications of theoretical knowledge to real-life situations. <br> <br> Education <br> * Ed.D., University of Cincinnati, Cincinnati, OH (Educational Foundations) <br> * MBA, De La Salle University , Manila, Philippines (Business Administration) <br> * B.S., University of the Philippines, Diliman Quezon City, Philippines (Business Administration)"
},

  {   "name"  : "Mayor Ron Falconi",
      "photo" :  "Ron_Falconi.jpg",
      "title" : "Mayor, City of Brunskwick <br> Brunskwick, OH",
      "topic" : "LEADERSHIP: Panel - The Rise of Filipino Americans in U.S. Politics/Public Service",
      "bio" : "Ron Falconi began his term as Mayor of Brunswick in 2014. Originally, he was appointed to the Council-at-Large seat in 2008 among a group of 14 applicants. He successfully defended the seat and won a full term in 2009. <br> <br> Mayor Falconi was born and raised in northeastern Ohio. He received his diploma from Padua Franciscan High School. He went on to receive his Bachelor of Arts degree from John Carroll University, where he majored in political science with a concentration in international studies. Subsequently, he received his law degree from the University of Akron, and he has a license to practice law in this state. He was also admitted to practice in the US District Court – Northern District of Ohio, and the US District Court – Western District of Pennsylvania. In addition to that, he has represented clients in the US Immigration Court and before the US Citizenship and Immigration Service. He operates his own law practice and does a majority of his work in Cuyahoga and Medina counties. <br> <br> Mayor Falconi has been active in the community. He was a former member of the Brunswick Board of Zoning Appeals, and served on that board from 2004 to 2007. He is also active at St. Ambrose Church, where he is a lector and a former bingo team participant. He served as the government liaison officer for the Fairway’s Homeowners Association. He also has served as a Guardian ad Litem in both Medina and Cuyahoga Counties. <br> <br> During his time on city council, Mayor Falconi had served at one time or another on the following committees: <br> <br> Mayor Falconi Economic Development (Chair) <br> Planning and Zoning (Chair) <br> Safety Committee <br> Finance Committee <br> Building and Building Code <br> Mayor Falconi has been married to his wife, Genevive, since 1998, and they have two (2) beautiful children. They have lived in Brunswick since 2001. His interests include history, travel, and singing."
},

  {   "name"  : "Brendan Flores",
      "photo" :  "Brendan_Flores.jpg",
      "title" : "National Chair, National Federation of Filipino American Associations (NaFFAA) <br> Washington, DC <br> <br> Vice President-Regional Banking Manager, Wells Fargo Bank,  <br> Ponte Verda Beach, FL",
      "topic" : "WELCOME: NaFFAA Introduction and History",
      "bio" : "Now the NaFFAA National Chair, Brendan has served as NaFFAA National Youth Chair and NaFFAA National Treasurer. Brendan’s community involvement both locally and nationally led him to establish a series of networks, awards, and scholarship opportunities for other driven individuals. He is a scholarship grantor for The Public Education Foundation of Las Vegas, and president of the Alumni Leadership Circle of the Academy of Finance. <br> <br> Currently the Regional Banking District Manager and Vice President at Wells Fargo in Florida, Brendan is the president of Emerging Leaders United in Saint John’s county, Florida. He is a graduate of three internal and external leadership executive programs both in Pennsylvania and Florida states. <br> <br> Brendan is the youngest National Chairman elected to the position. He succeeds 64-year-old JT Mallonga, a New York immigration lawyer who served for two years. Preceeding Mallonga was retired engineer Ed Navarra of Bloomfield, Michigan, who was 66 when he was elected to the top post in 2010. NaFFAA’s founding chairman, Alex Esclamado, was 85 when he led the first empowerment conference in 1997. He was followed by Philanthrophist Loida Nicolas Lewis, Entrepreneur Alma Kern, and Publisher Greg Macabenta - all in their 60s when they were elected as the National Chairman."
}

,

  {   "name"  : "Cynthia Flores",
      "photo" :  "Cynthia_Flores.jpg",
      "title" : "Development and Fundraising Chair, National Federation of Filipino American Associations Region 3 East (NaFFAA R3E) <br> <br> President, JAYDEE Properties <br> Chicago, IL",
      "topic" : "PARTNERSHIP:  Federation of Philippine American Chambers of Commerce",
      "bio" : " <br> <br>  <br> <br>  <br> <br> "
},

  {   "name"  : "Kelly Ilagan",
      "photo" :  "Kelly_Ilagan.jpg",
      "title" : "National Operations Officer, National Federation of Filipino American Associations (NaFFAA) <br> Washington, DC <br> <br> Deputy Associate Director for Presidential Personnel, The White House <br> Washington D.C. ",
      "topic" : "WELCOME: NaFFAA Introduction and History",
      "bio" : "Kelly Ilagan, currently works as a Deputy Associate Director for Presidential Personnel in the White House. A native of Michigan but current Ohioan, Kelly previously served as a Public Affairs Liaison in the Office of Ohio Treasurer Josh Mandel. In this capacity, she serves as an outreach liaison on behalf of the Treasurer of Ohio's local governements and organizations. <br> <br> Prior to this, Kelly was a Constituent Relations Staffer for former Congressman Mike Rogers(R08), where she specialized in Agriculture, Education and immigration policy casework. In addition, she worked in various capacities for Michigan Governor Rick Snyder in 2013 and several Michigan and Ohio House and Senate campaigns over the past few years. Kelly received her Bachelor of Arts degree in Interdisciplinary Studies in International Studies and Political Science with a minor in Mandarin Chinese and Econoics from Michigan State University. <br> <br> Illagan is incredibly passionate about serving her community on a local level. She served in various local organization such as the President of the Young Republican Women of Columbus, VP of the Philippine American Society of Central Ohio (PASCO), youth director of the Filipino American Republican of Michigan to name a few. Kelly Illagan's passion for the political process and community organizing resulted in being named as part of the Asian Fortune News 50 Young Asian American Stars in Politics"
},

  {   "name"  : "Jung Kim",
      "photo" :  "Jung_Kim.jpg",
      "title" : "Managing Director, Research and Business Intelligence, Columbus 2020 <br> Columbus, OH",
      "topic" : "PLENARY: Research on Future of our Economy and How Millennials are Taking Over",
      "bio" : " Jung Kim joined the Columbus 2020 team in November 2010. As managing director, research and business intelligence, Jung oversees all of Columbus 2020’s economic and business research. <br> <br> Previously, Jung held positions at Community Research Partners, a nonprofit research center based in Columbus; the State of New Jersey’s Office of Smart Growth; and Strategic Planning Advice, an economics and planning consulting firm in the UK. Jung graduated with a Bachelor of Arts in sociology and urban studies from Northwestern University and Master of Science in regional and urban planning from the London School of Economics. <br> <br> Jung is a member of the American Planning Association and the Urban Land Institute."
},

  {   "name"  : "Joy Kouns-Lewis, PhD, SPHR, RCC",
      "photo" :  "Joy_Kouns-Lewis.jpg",
      "title" : "Senior Director of HR, Children's Hunger Alliance <br> Columbus, OH",
      "topic" : "PLENARY: Understanding Communication Styles",
      "bio" : " Dr. Joy Kouns-Lewis is the Founder and CEO of The Joy of Coaching, LLC. She specializes in Career and Executive Coaching, Diversity, Wellness and Human Resources Management Programs. She is a frequent speaker in Human Resources and Diversity Conferences globally. She has worked for the public and private sector as Human Resource executive and is currently the Senior Director in Human Resources for Children’s Hunger Alliance. She is an Associate Faculty at the graduate school of Davenport University, Strayer University, Excelsior College and teaching Human Resource Management courses. She most recently chaired the Ohio Asian Awards in Columbus, and serves as the Vice President and Board Member of the Asian American Commerce Group. She held executive positions in HR for CMHA, the American Red Cross, The Mid-Ohio Regional Planning Commission, and Nationwide Insurance Co. in Columbus, Ohio. She was former President of PASCO and currently the President of Progressive Speaking Toastmasters Club in Central Ohio. <br> <br> Joy earned her Doctorate degree in Organization and Management with a specialization in Human Resources Management from Capella University. She has a lifetime certification as Senior Human Resources Professional (SPHR), certified SHRM-SCP and Registered Corporate Coach. She was Vice President of Membership for the Human Resources Association of Central Ohio and a Member of the Society of Human Resource Management. <br> <br> Joy is married with a son and a step son. She and her family reside in Dublin, Ohio."
},

  {   "name"  : "Cora Muñoz, PhD",
      "photo" :  "Cora_Munoz.jpg",
      "title" : "Professor Emeritus, Capital University <br> Columbus, OH",
      "topic" : "PARTNERSHIP: Columbus Asian Festival",
      "bio" : " Dr. Cora Munoz is a professor emeritus and adjunct professor at Capital University. She is an author, academic scholar, and consultant, national and international speaker, Fulbright Scholar, diversity trainer, health advocate and a community worker. She has served for many years as the Governor appointed Commissioner of the Ohio Commission on Minority Health. She is the President of the Ohio Asian American Health Coalition, member of the Asian American Pacific Islander Advisory Council and has served as Chairperson of the Health committee. Currently she is the Chairperson of the Asian Festival Corporation Board of Directors and member of the Health and Wellness committee in which she served as chairperson for many years since 1995. She has given time and talent to the larger community as an advocate for health and wellness. Her participation as a board member of various organizations in the past and in the present attest to her exceptional service to the community at large. <br> <br> Cora has also served in various boards and advisory groups related to health and mental health such as the Multiethnic Advocacy for Cultural Competence/ODMH research advisory; Mental Health Board of America; Lutheran Social Services, Breathing Association of Ohio; and Advisory to Minority Health at Columbus Public Health. <br> <br> Cora has received numerous awards and recognitions for her contribution to the nursing profession, leadership, and minority health and community health advocacy. She is the founder of the Philippine Nurses Association of Indiana and the Philippine Nurses Association of Central Ohio. As a nurse she is involved in numerous projects such as a five year Komen funded Breast Health Screenings and Education program for Asian Women. She is also part of the BFree Columbus CDC funded project through OAAHC training Community Health Advocates in the Asian and African communities. <br> <br> Cora is a master trainer for the Stanford curriculum for Chronic Disease Self-Management and has done numerous trainings and workshops for the Asian community. She is a certified trainer for Multiethnic Advocates for Cultural Competency and a certified Mental Health First Aid from ADAMH of Franklin County."
},

  {   "name"  : "James Paat",
      "photo" :  "James_Paat.jpg",
      "title" : "President & CEO InXite Health Systems <br> Dublin, OH",
      "topic" : "LEADERSHIP: Panel - Success Stories from Filipino American Entrepreneurs – Generation X",
      "bio" : " <br> <br>  <br> <br>  <br> <br> "
},

  {   "name"  : "Honorable Tony Paat",
      "photo" :  "Tony_Paat.jpg",
      "title" : "Magistrate, Franklin County Municipal Court <br> Columbus, OH",
      "topic" : "LEADERSHIP: Panel - The Rise of Filipino Americans in U.S. Politics/Public Service",
      "bio" : "Appointed in the Franklin County Municipal Court in 1994, Magistrate Paat regularly presides over Eviction, Traffic and Small Claims proceedings. He has also conducted civil jury and non- jury trials, criminal/ traffic trials, criminal arraignments and the Environmental Court docket. <br> <br> Magistrate Paat has been an instructor and a featured speaker for Capital University, The Ohio State University College of Law, The Columbus Bar Association, and the Supreme Court of Ohio Judicial College."
},

  {   "name"  : "Elizabeth Piocos",
      "photo" :  "Elizabeth_Piocos.jpg",
      "title" : "Secretary, National Federation of Filipino American Associations Region 3 East (NaFFAA R3E) <br> <br> Academic Director, Dept of Chemistry, University of Cincinnati <br> Cincinnati, OH",
      "topic" : "PLENARY: Defining Filipino",
      "bio" : "Beth Piocos is strong and dynamic leader who delivers results, develops people, and unleashes the potential of organizations. She has a breadth of experience as a Research and Technical Manager, Scientist and Researcher, Faculty Member, Entrepreneur and Business Owner, and most recently, as an Academic Director."
},

  {   "name"  : "Shyam Rajadhyaksha",
      "photo" :  "Shyam_Rajadhyaksha.jpg",
      "title" : "Equity Partner and CFO, DLZ Corporation <br> Columbus, OH",
      "topic" : "PARTNERSHIP: Asian American Commerce Group",
      "bio" : " Shyam Rajadhyaksha serves multiple roles at DLZ. He is responsible for corporate marketing strategy including company website, communications, intranet, and CRM system. He oversees the renewable energy division which develops hydropower and hydrokinetic projects on a design, build, own, and operate basis. He also serves on the Board of Directors. <br> <br> Education <br> Master of Business Administration, University of Florida <br> European Management Exchange Program, Manchester Business School <br> Bachelor of Urban Planning, University of Cincinnati"
},

  {   "name"  : "Amy Schossler",
      "photo" :  "Amy_Schossler.jpg",
      "title" : "Executive Director, Upper Arlington Commission on Aging <br> Upper Arlington, OH",
      "topic" : "PARTNERSHIP: Aging in America - A Proactive Approach to Senior Services",
      "bio" : "Amy Schossler is the Executive Director of the Upper Arlington Commission on Aging, a non-profit organization providing support, education and advocacy for older adults and their families. <br> <br> The services they provide include: Kind Call, Project Lifesaver, Medicare Counseling, Fitness/Balance Classes and other educational programs. <br> <br> Their specialties are in the areas of Senior Advocacy, Medicare Counseling, Kind Call, and Project Lifesaver. <br> <br> Amy's responsibilities include: <br> <br> * Responsible for all administrative activities of the Commission on Aging. <br> * Management of the Kind Call and Project Lifesaver programs in partnership with the City of Upper Arlington. <br> * Develop and maintain the annual budget and monthly financial statements, including annual fundraising campaign. <br> * Develop and secure advertising in the bi-annual Upper Arlington Resource Directory for Older Adults and their Families. Publication is mailed to every household in Upper Arlington. <br> * Provide Medicare counseling to seniors regarding prescription drug plans and supplemental insurance. <br> * Develop educational programs and services to assist seniors, including Fitness Trek, Sandwich Stroll, Medicare counseling, and A Matter of Balance. <br> * Develop quarterly newsletter mailed to over 350 seniors in the Upper Arlington area. <br> * Serve as a community liaison to local groups including the UA Chamber of Commerce, Volunteer UA, UA Senior Center and the City of Upper Arlington."
},

  {   "name"  : "Jennifer Sconyers",
      "photo" :  "Jennifer_Sconyers.jpg",
      "title" : "President & Founder, Adundance Leadership Counseling, LLC <br> Columbus, OH",
      "topic" : "MENTORSHIP: Navigating High Stakes Communications",
      "bio" : "Jennifer Sconyers has spent almost two decades as a woman of color in leadership. She's learned how to manage up, down and sideways, build teams from scratch, and inherit teams to make them peak performing. Her career has spanned across for-profit institutions in advertising, marketing and television, as well as working in political institutions in Washington DC, Maryland, and Ohio. <br> <br> It was the decade plus Jennifer spent working on Democratic campaigns that gave her the most experience. It was in these high pressure, results driven environments that she truly learned what it would take to create a high performing team and make it thrive in a short period of time. She's had the experience of working with teams in national and statewide non-profits, including the ACLU and Wellstone Action, and has worked in for-profit companies like Fox and Lee Wayne Corporation. In every environment she has created opportunities to achieve high team goals, create space to include individuals from diverse backgrounds (and advocate for their presence on team), while also diligently establishing environments where high stakes conversations can occur. It is this experience that she brings to her work with teams and in her work with individuals who are looking to make an impact in their organization and their community. <br> <br> Over the years Jennifer has learned from her successes and mistakes. She has seen first hand what makes a high performing team function and what holds it back. She has also seen the importance of having team members who are passionate about their work and who also feel fully invested in by their organization. So if you are the manager or leader of a team who is looking to increase results, or if you are a woman who’s looking to find passion again for what you do, give her a call. Jennifer would love to work with you to create your results!"
},

  {   "name"  : "Major General Antonio Taguba",
      "photo" :  "Antonio_Taguba.jpg",
      "title" : "US Army (Retired) ",
      "topic" : "PLENARY: AARP Dahil Mahal Kita Caregiving Program <br> KEYNOTE: Filipino Veterans Recognition and Education Project (FilVetREP)",
      "bio" : "Major General Taguba retired on January 1, 2007 after serving 34 years on Active Duty. <br> <br> He is President, TDLS Consulting, LLC which provides business consulting services to small business companies - disabled veteran owned and 8a certified. He is Chairman, Pan Pacific American Leaders and Mentors (PPALM), a national, all volunteer, charitable, non-profit, 501(c)(3) tax exempt professional organization committed to mentoring and professional development of military and civilian leaders. He served as Vice President for Army Account, SERCO Inc, a leading professional services company from July 2007 to Nov 2008. He currently serves as Vice Chairman, Armed Forces Insurance Board of Directors. A community action and service volunteer, he serves on non-profit boards and volunteer organizations assisting Veterans and families on benefits issues, raising funds for college scholarships, support of children of incarcerated parents, and duty with United Service Organization. <br> <br> Born in Manila, Philippines on October 31, 1950, Major General Taguba was commissioned as an Armor Officer and distinguished military graduate from Idaho State University in May 1972. He has served in numerous command and staff positions from platoon to General officer level. His service tours included assignments in the United States, South Korea, Germany, and Kuwait. <br> <br> During Operation Iraqi Freedom, he served as Deputy Commanding General for Support, Coalition Forces Land Component Command/Army Central Command/Third U.S. Army, forward deployed to Kuwait and Iraq. He was responsible for logistical and services to U.S. and Coalition Forces totaling over 150,000 troops conducting combat operations. His duty included support of U.S. troops and coordination of host nation support from the Government of Kuwait, and security/training support in Saudi Arabia, Jordan, Egypt, and Qatar. <br> <br> Upon his redeployment, he served as Deputy Assistant Secretary of Defense for Reserve Affairs, Office of the Secretary of Defense, Pentagon. He later served as Deputy Commanding General, U.S. Army Reserve Command on his last assignment on active duty. <br> <br> His military awards and decorations include the Army Distinguished Service Medal (2 awards), Legion of Merit (4 awards), Bronze Star Medal, Meritorious Service Medal (6 awards), Office of Secretary of Defense Identification Badge, and Army Staff Identification Badge. <br> <br> He received an Honorary Degree of Doctor of Humane Letters from the University of San Francisco on May 17, 2008. <br> <br> Major General Taguba graduated from Idaho State University with a BA degree in History; Webster University with a MA degree in Public Administration; Salve Regina University with a MA degree in International Relations; and U.S. College of Naval Command and Staff with MA degree in National Security and Strategic Studies. He is also a graduate of the U.S. Army Command and General Staff College, and U.S. Army War College. <br> <br> He is married to Debra Ann Taguba. Their adult children are Lindsay Taguba Keys and Captain Sean Taguba, Armor, U.S. Army."
},

  {   "name"  : "Senator Charleta B. Tavares",
      "photo" :  "Charleta_Tavares.jpg",
      "title" : "Ohio Senate, District 15 <br> Columbus, OH",
      "topic" : "PLENARY: Voice of Leadership – How Leaders Inspire and Achieve",
      "bio" :  "Charleta B. Tavares (D-Columbus) was re-elected and sworn in on January 5, 2015 as the State Senator for the 15th District and Assistant Democratic Leader in the Ohio Senate. A committed public servant, she has served since 2011 as the State Senator, which includes, Bexley and parts of Grandview Heights as well as the historic neighborhoods of the city of Columbus. She currently serves as the Senate ranking member on both the Ways and Means and the Health and Human Services Committees. In addition, she also serves as a member of the Finance, Finance Subcommittee on Corrections, Joint Medicaid Oversight Committee, Joint Committee on Agency Rules and Review, and serves as Co-Chair of the Ohio Constitutional Modernization Commission. <br> <br> Senator Tavares previously served as member of Columbus City Council from 1999-2010. Prior to joining Council, she left a legacy for the citizens of Ohio during her 5 ½-year tenure in the Ohio General Assembly as the State Representative in the 22nd House District. She is the first African-American and Democrat female to serve in the state legislature from Franklin County, Ohio (House and Senate) and the first African-American woman ever to hold a leadership position in the history of the Ohio General Assembly. <br> <br> Senator Tavares was recently selected to serve as the President/CEO of Primary One Health. A federally qualified primary healthcare system to provide access to services that improve the health status of families including people experiencing financial, social, or cultural barriers to health care. <br> <br> Senator Tavares recently served as Executive Director of the Multi-ethnic Advocates for Cultural Competence (MACC), a statewide non-profit membership organization whose mission is to enhance the quality of care in Ohio's health care system and to incorporate culturally competent models of practice into the systems and organizations that provide services to Ohio's diverse populations. <br> <br> Senator Tavares’ legislative priorities include: the elimination of health, education and criminal justice disparities; investment in Ohio’s infrastructure; consumer protection; and addressing family stability. <br> <br> Senator Tavares is a native of Columbus. She attended Eastmoor High School, Spellman College in Atlanta, GA, and The Ohio State University."
},

  {   "name"  : "Jason Tengco",
      "photo" :  "Jason_Tengco.jpg",
      "title" : "Executive Director, National Federation of Filipino American Associations (NaFFAA) <br> Washington, DC",
      "topic" : "WELCOME: NaFFAA Introduction and History",
      "bio" : "Over the past decade, Jason has worked for a presidential campaign, the White House, Obama Administration, Congress, and numerous non-profit and campus organizations. In 2016, Jason served as the National Asian American and Pacific Islander (AAPI) Outreach Director for Hillary for America. Previously, Jason worked for the White House Initiative on AAPIs from 2012 to 2016, where he was appointed as Deputy Director in 2015. Throughout his tenure, Jason organized the first-ever White House Celebration of Filipino American History Month, managed the White House Summit on AAPIs, and led the Initiative’s national AAPI community engagement. <br> <br> Throughout his career, Jason has participated in fellowships with the Asian Pacific American Institute for Congressional Studies in the office of Congressman Mike Honda, New Leaders Council, Asian Pacific American Labor Alliance, Center for Progressive Leadership, and Public Policy and International Affairs Program. <br> <br> In 2014, Jason was selected as one of ten delegates to the Philippine Embassy’s Filipino American Youth Leadership Program (FYLPro), a week-long immersion in the Philippines. Born and raised in the San Francisco Bay Area, Jason graduated from UCLA with Honors with a B.A. in Political Science. At UCLA, Jason was heavily involved with Samahang Pilipino and received the Outstanding Pinoy Leadership Award."
},

  {   "name"  : "Krizzia Yanga",
      "photo" :  "Krizzia_Yanga.jpg",
      "title" : "Owner and Operator, Bonifacio Restaurant and Red Velvet Cafe <br> Columbus, OH",
      "topic" : "LEADERSHIP: Panel - Success Stories from Filipino American Entrepreneurs – Millennials",
      "bio" : " <br> <br>  <br> <br>  <br> <br> "
}     


]
